INJ_WEB_PROXY/run 2/wrk_via_waf_c1000_t4_200s_run1.txt
Running 3m test @ http://10.0.2.1/
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.87ms   77.64ms   1.83s    93.07%
    Req/Sec     7.47k     0.93k   12.08k    71.14%
  Latency Distribution
     50%    7.28ms
     75%   61.02ms
     90%  100.59ms
     99%  328.51ms
  5944511 requests in 3.33m, 1.37GB read
  Socket errors: connect 0, read 1184091, write 0, timeout 206
  Non-2xx or 3xx responses: 256
Requests/sec:  29720.11
Transfer/sec:      7.03MB